{"bg_color":"26292dff","data":[{"check":false,"color_theme":"Light","header_text":"Overview","id":52658547310544,"is_md":true,"is_visible_check":false,"node":"TextDocument","path":"","position_offset_x":1428.0,"position_offset_y":-224.0,"selectable":true,"size_x":1008.0,"size_y":868.0,"text_edit_text":"[b]The Dead Are Angry![/b]\nThe enemies are unsatisfied souls, people whose lives were cut short by the empire.\n\n[b]Quandry[/b]\nAt the end of the game, the player meets the vengeful spirit of their friend who died because of the emperor's madness, the player will be given a choice:\n\nYou don't [i]have to defeat the game's final enemies [/i], you can bring down the empire, but [i]everyone[/i] will burn, not just the rich and powerful.\n\n[b]NPCs[/b]\nThe protagonist doesn't say much, so we need other characters to talk to one another to deliver [b]key details[/b] of the game.\n\n[b]Gladiator Friends[/b]\nA little [i]comic relief[/i] at the beginning:\nRome is failing, outside the city walls, but it's been covered up and your two friends argue about it. ([i]We can hide exposition inside their quarrel.[/i])\n\n[b]The Gullible Gladiator[/b]\nOne of your gladiator friends has heard the rumors that Rome is in trouble and believes them.\n([i]But this friend believes [/i]every[i] rumor ever, and this is the first time a rumor they believed actually turned out to be true.[/i])\n\n[b]The Cynical Gladiator[/b]\nYour cynical gladiator friend is tired of indulging rumors, that is why they argue.\n\n[b]Dead Friends Become Vengeance Spirits[/b]\nYour friends will die over the course of the story, due to the emperor's madness and desperate maneuvers while trying to keep Rome afloat.\n\nThese are the characters who explain to the player that the undead they've been fighting: [i]have a point[/i] and offer the player the choice to let them destroy Rome and its inequalities. But the choice to let the carnage continue is complicated by:\n\n[b]Found Family[/b]\nIn the second region, you leave the walls, and meet many of the [i]lovely[/i] people who make their life outside the city walls.\n\nThey will be [i]so[/i] lovable, that players will be torn, some will finish the quest, fight back the undead, and let Rome continue [i]just[/i] so these wonderful characters they meet can continue living.\n\n[b]This Horror Is The Emperor's Fault[/b]\nThis is [b]Horror Genre[/b], these punishments from the underworld were brought on by terrible choices from the emperor.\n\nThink of [i]every bad boss and bad company-owner you've ever known[/i], and we can use those details in the game to make the emperor someone who deserved to have retribution from hell.\n\nWe want the player to relate to hating this emperor specifically, so that the emperor is not generic.\n\nThe more the player hates the emperor, the more tempting the choice is at the end, to let Rome ([i]but also all your new friends[/i]) burn."}],"default_line_color_theme":"Black","default_text_color_theme":"Light","grid_color":"ffffff33","minimap_enabled":true,"scroll_offset_x":1074.697265625,"scroll_offset_y":-554.734008789063,"snap_distance":28,"sound_volume":0.3,"use_snap":true,"zoom":1.0}